recipes/creamy-ramen.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creamy Ramen</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Creamy Ramen</h1>
<p>
<a href="https://www.youtube.com/watch?v=9E66VTQjhgA">Original link - Yeung Man Cooking</a>
</p>

<div id="outline-container-orge956f59" class="outline-2">
<h2 id="orge956f59">Ingredients</h2>
<div class="outline-text-2" id="text-orge956f59">
<ul class="org-ul">
<li>1/2 cup coconut cream</li>
<li>100g extra firm tofu</li>
<li>3 fresh shiitake mushrooms</li>
<li>60g broccolini</li>
<li>1 tsp cane sugar</li>
<li>1 tsp toasted sesame oil</li>
<li>2 tbsp <a href="homemade-chilli-oil.html"> chilli oil</a></li>
<li>1 1/2 tbsp + 1 tsp soy sauce</li>
<li>1 tbsp white sesame paste</li>
<li>140g ramen noodles</li>
<li>2 1/2 cups veggie stock</li>
<li>2 tbsp avocado oil</li>
<li>2 tsp dark soy sauce</li>
<li>chili threads to garnish</li>
</ul>
</div>
</div>

<div id="outline-container-org3408826" class="outline-2">
<h2 id="org3408826">Instructions</h2>
<div class="outline-text-2" id="text-org3408826">
<ol class="org-ol">
<li>Bring a pot of water to boil for the noodles</li>
<li>Scoop out the coconut cream from the can and set it aside</li>
<li>Mash the tofu into a crumble with a fork. Finely chop the shiitake mushrooms and broccolini</li>
<li>In the ramen bowl, whisk together the cane sugar, a splash of toasted sesame oil, 1 tbsp chili oil, 1 1/2 tbsp soy sauce, and the white sesame paste</li>
<li>When the water comes to a boil, cook the noodles to package instructions. Stir the noodles occasionally</li>
<li>Strain out the noodles and set aside. Toss the noodles with a splash of toasted sesame oil</li>
<li>Whisk together the veggie stock and coconut cream in a pot heating on medium high heat</li>
<li>Heat up a nonstick pan to medium heat. Add in the avocado oil</li>
<li>Saute the tofu for 2-3min. Then add the broccolini and mushrooms and saute for another 2-3min</li>
<li>Add 1 tsp soy sauce and 2 tsp dark soy sauce. Saute for another minute</li>
<li>When the broth comes to a boil, pour it into the ramen bowl. Place in the noodles followed by the sauteed veggies</li>
<li>Garnish with some chili threads and another tbsp of chili oil</li>
</ol>
</div>
</div>
</div>
</body>
</html>
